# YOLOv5s model configuration file
nc: 6  # Number of classes
depth_multiple: 0.33  # Depth scaling multiplier
width_multiple: 0.50  # Width scaling multiplier

# Anchors (for the detection layers)
anchors:
 - [15, 14, 24, 22, 7, 9]  # Smaller scale
 - [38, 30, 60, 47, 54, 91] # Medium scale
 - [140, 160, 79, 187, 191, 244]  # Larger scale

backbone:
  # [from, number, module, args]
  [[-1, 1, ConvAtrous, [64, 6, 2, 1, 6]],  # 0-P1/2, dilation=6
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, ConvAtrous, [256, 3, 2, 1, 6]], # 3-P3/8, dilation=6
   [-1, 6, C3, [256]],
   [-1, 1, ConvAtrous, [512, 3, 2, 1, 6]],# 7-P5/32, dilation=6
   [-1, 9, C3, [512]],
   [-1, 1, CombinedModel, [512, nc]],  # CombinedModel with input channels=512, output channels=nc
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # Cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # Cat backbone P3
   [-1, 3, C3, [256, False]],  # 17

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # Cat head P4
   [-1, 3, C3, [512, False]],  # 20

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # Cat head P5
   [-1, 3, C3, [1024, False]],  # 23

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # 24-Detect(P3, P4, P5)
  ],